// Визначаємо простір імен для перерахувань, пов'язаних з сервером NeoBid
namespace NeoBid.Server.Data.Enums
{
    // Перерахування AuctionState визначає можливі стани аукціону
    public enum AuctionState
    {
        Draft,    // Стан "Чернетка", використовується коли аукціон ще формується та не готовий до публікації
        Open,     // Стан "Відкритий", використовується коли аукціон активний та приймає ставки
        Finished  // Стан "Завершений", використовується коли аукціон завершено
    }
}
